# фрагмент А
first = 2
second = 3
print(first + second)

#first и second это строки, поэтому + склеивает их в "23",
# а не складывает как числа

#фрагмент Б
age = int(input("Возраст: "))
print(age + 1)

#так как input() всегда возвращает строку,
# а к строке нельзя прибавить целое число.

#так как input() всегда возвращает строку,
# фрагмент В
first = 4
second = 7
third = 10
average = (first + second + third) / 3
print(average)

# phyton следует правилам математики, поэтому из-за приоритета операций
#деление выполняется раньше
#Для того чтобы программа выполнялась коректно, переменные first, second, third
# нужно заключить в скобки